willeeg/nucleo-stm32wl55-fuotav2/Projects/B-WL5M-SUBG1/Applications/LoRaWAN_FUOTA_ExtFlash/LoRaWAN_End_Node/Core/Src/flash_if.c
  if (BSP_FLASH_DeInit(FLASH_IF_EXT_INSTANCE) != BSP_ERROR_NONE)
  {
    ret_status = FLASH_IF_ERROR;
  }
  /* USER CODE BEGIN FLASH_IF_DeInit_2 */

  /* USER CODE END FLASH_IF_DeInit_2 */
  return ret_status;
}

FLASH_IF_StatusTypedef FLASH_IF_Write(void *pDestination, const void *pSource, uint32_t uLength)
{
  FLASH_IF_StatusTypedef ret_status = FLASH_IF_ERROR;
  /* USER CODE BEGIN FLASH_IF_Write_1 */

  /* USER CODE END FLASH_IF_Write_1 */
  if (IS_FLASH_MAIN_MEM_ADDRESS((uint32_t)pDestination))
  {
    ret_status = FLASH_IF_INT_Write(pDestination, pSource, uLength);
  }
  else if (IS_FLASH_EXT_MEM_ADDRESS((uint32_t)pDestination))
  {
    ret_status = FLASH_IF_EXT_Write(pDestination, pSource, uLength);
  }
  /* USER CODE BEGIN FLASH_IF_Write_2 */

  /* USER CODE END FLASH_IF_Write_2 */
  return ret_status;
}

FLASH_IF_StatusTypedef FLASH_IF_Read(void *pDestination, const void *pSource, uint32_t uLength)
{
  FLASH_IF_StatusTypedef ret_status = FLASH_IF_ERROR;
  /* USER CODE BEGIN FLASH_IF_Read_1 */

  /* USER CODE END FLASH_IF_Read_1 */
  if (IS_FLASH_MAIN_MEM_ADDRESS((uint32_t)pSource))
  {
    ret_status = FLASH_IF_INT_Read(pDestination, pSource, uLength);
  }
  else if (IS_FLASH_EXT_MEM_ADDRESS((uint32_t)pSource))
  {
    ret_status = FLASH_IF_EXT_Read(pDestination, pSource, uLength);
  }
  /* USER CODE BEGIN FLASH_IF_Read_2 */

  /* USER CODE END FLASH_IF_Read_2 */
  return ret_status;
}

FLASH_IF_StatusTypedef FLASH_IF_Erase(void *pStart, uint32_t uLength)
{
  FLASH_IF_StatusTypedef ret_status = FLASH_IF_ERROR;
  /* USER CODE BEGIN FLASH_IF_Erase_1 */

  /* USER CODE END FLASH_IF_Erase_1 */
  /* Check Flash start address */
  if (IS_FLASH_MAIN_MEM_ADDRESS((uint32_t)pStart))
  {
    ret_status = FLASH_IF_INT_Erase(pStart, uLength);
  }
  else if (IS_FLASH_EXT_MEM_ADDRESS((uint32_t)pStart))
  {
    ret_status = FLASH_IF_EXT_Erase(pStart, uLength);
  }
  /* USER CODE BEGIN FLASH_IF_Erase_2 */

  /* USER CODE END FLASH_IF_Erase_2 */
  return ret_status;
}

/* USER CODE BEGIN EF */

uint32_t FLASH_IF_PAGE_Index (uint32_t pStart)
{
   if (IS_FLASH_MAIN_MEM_ADDRESS(pStart))
   {
     return PAGE_INDEX(pStart);
   }
   else if (IS_FLASH_EXT_MEM_ADDRESS(pStart))
   {
     return (pStart - FLASH_IF_EXT_FLASH_ADDRESS) / MX25L4006_SECTOR_SIZE;
   }
   return 0;
}

uint32_t FLASH_IF_EXT_Page_Address (uint32_t uIndex)
{

	return FLASH_IF_EXT_FLASH_ADDRESS + uIndex * MX25L4006_SECTOR_SIZE;
}

bool FLASH_IF_IsExt (uint32_t uStart)
{
	if (IS_FLASH_EXT_MEM_ADDRESS(uStart))
	{
		return true;
	}
	else
	{
		return false;
	}
}

/* CRC32 reversed polynomial 0xEDB88320*/
static const uint32_t reversedPolynom = 0xEDB88320;
#define CRC32_BUFFER_SIZE	64
static uint8_t crc32buffer[64];

uint32_t FLASH_IF_CRC32 (uint32_t uStart, uint32_t uLength)
{
    /*CRC initial value*/
    uint32_t crc = 0xFFFFFFFF;
    uint32_t length;
    uint32_t source = uStart;

    while (uLength) {
    	length = uLength > CRC32_BUFFER_SIZE ? CRC32_BUFFER_SIZE : uLength;
    	if (FLASH_IF_Read(crc32buffer, (uint8_t *)source, length) != FLASH_IF_OK)
    	{
    		return 0;
    	}
    	for( uint16_t i = 0; i < length; ++i )
		{
			   crc ^= ( uint32_t )crc32buffer[i];
			   for( uint16_t i = 0; i < 8; i++ )
			   {
				   crc = ( crc >> 1 ) ^ ( reversedPolynom & ~( ( crc & 0x01 ) - 1 ) );
			   }
		}
		uLength -= length;
		source += length;
    }
    return ~crc;
}

uint32_t FLASH_IF_Page_Size (void) {

	return MX25L4006_SECTOR_SIZE;
}


uint32_t FLASH_IF_Alignment_Size (void) {

	return FLASH_WRITE_ALIGNMENT;
}

uint32_t FLASH_IF_Active_Start (void) {

	return FOTA_ACT_REGION_START;
}

uint32_t FLASH_IF_Active_Size (void) {

	return FOTA_ACT_REGION_SIZE;
}

uint32_t FLASH_IF_Download_Start (void) {

	return FOTA_DWL_REGION_START;
}

uint32_t FLASH_IF_Download_Size (void) {

	return FOTA_DWL_REGION_SIZE;
}

uint32_t FLASH_IF_Swap_Start (void) {

	return FOTA_SWAP_REGION_START;
}

uint32_t FLASH_IF_Swap_Size (void) {

	return FOTA_SWAP_REGION_SIZE;
}

/* USER CODE END EF */

/* Private Functions Definition -----------------------------------------------*/

/* Private Functions : internal flash -----------------------------------------*/
static FLASH_IF_StatusTypedef FLASH_IF_INT_Write(void *pDestination, const void *pSource, uint32_t uLength)
{
  FLASH_IF_StatusTypedef ret_status = FLASH_IF_OK;
  /* USER CODE BEGIN FLASH_IF_INT_Write_1 */

  /* USER CODE END FLASH_IF_INT_Write_1 */
  uint32_t uDest = (uint32_t)pDestination;
  uint32_t uSource = (uint32_t)pSource;
  uint32_t length = uLength;
  uint32_t page_index;
  uint32_t address_offset;
  uint32_t start_page_index;
  uint32_t page_address;
  uint32_t number_pages;
  uint32_t current_dest;
  uint32_t current_source;
  uint32_t current_length;
  uint64_t src_value;

  if ((pDestination == NULL) || (pSource == NULL) || !IS_ADDR_ALIGNED_64BITS(uLength)
      || !IS_ADDR_ALIGNED_64BITS((uint32_t)pDestination))
  {
    return FLASH_IF_PARAM_ERROR;
  }

  /* Clear error flags raised during previous operation */
  ret_status = FLASH_IF_INT_Clear_Error();

  if (ret_status == FLASH_IF_OK)
  {
    /* Unlock the Flash to enable the flash control register access */
    if (HAL_FLASH_Unlock() == HAL_OK)
    {
      start_page_index = PAGE_INDEX(uDest);
      number_pages = PAGE_INDEX(uDest + uLength - 1U) - start_page_index + 1U;

      if (number_pages > 1)
      {
        length = FLASH_PAGE_SIZE - (uDest % FLASH_PAGE_SIZE);
      }

      for (page_index = start_page_index; page_index < (start_page_index + number_pages); page_index++)
      {
        page_address = page_index * FLASH_PAGE_SIZE + FLASH_BASE;
        if (FLASH_IF_INT_IsEmpty(pDestination, length) != FLASH_IF_MEM_EMPTY)
        {
          if (pAllocatedBuffer == NULL)
          {
            ret_status = FLASH_IF_PARAM_ERROR;
            break; /* exit for loop */
          }

          /* backup initial Flash page data in RAM area */
          FLASH_IF_INT_Read(pAllocatedBuffer, (const void *)page_address, FLASH_PAGE_SIZE);
          /* copy fragment into RAM area */
          UTIL_MEM_cpy_8(&pAllocatedBuffer[uDest % FLASH_PAGE_SIZE], (const void *)uSource, length);

          /*  erase the Flash sector, to avoid writing twice in RAM */
          if (FLASH_IF_INT_Erase((void *)page_address, FLASH_PAGE_SIZE) != FLASH_IF_OK)
          {
            ret_status = FLASH_IF_ERASE_ERROR;
            break; /* exit for loop */
          }

          /* copy the whole flash sector including fragment from RAM to Flash */
          current_dest = page_address;
          current_source = (uint32_t)pAllocatedBuffer;
          current_length = FLASH_PAGE_SIZE;
        }
        else
        {
          /* write a part of flash page from selected source data */
          current_dest = uDest;
          current_source = uSource;
          current_length = length;
        }

        for (address_offset = 0U; address_offset < current_length; address_offset += 8U)
        {
          UTIL_MEM_cpy_8(&src_value, (uint8_t *)(current_source + address_offset), sizeof(uint64_t));
          /* Device voltage range supposed to be [2.7V to 3.6V], the operation will be done by word */
          if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, current_dest, src_value) == HAL_OK)
          {
            /* Check the written value */
            if (*(uint64_t *)current_dest != src_value)
            {
              /* Flash content doesn't match SRAM content */
              ret_status = FLASH_IF_WRITE_ERROR;
              break;
            }
            /* Increment FLASH Destination address */
            current_dest = current_dest + 8U;
          }
          else
          {
            /* Error occurred while writing data in Flash memory */
            ret_status = FLASH_IF_WRITE_ERROR;
            break;
          }
        }

