willeeg/nucleo-stm32wl55-fuotav2/Projects/B-WL5M-SUBG1/Applications/LoRaWAN_FUOTA_ExtFlash/LoRaWAN_End_Node/Core/Src/flash_if.c
    if (BSP_FLASH_Write(FLASH_IF_EXT_INSTANCE, (uint8_t *)current_source, current_dest - FLASH_IF_EXT_FLASH_ADDRESS,
                        current_length) != BSP_ERROR_NONE)
    {
      /* Error occurred while writing data in Flash memory */
      ret_status = FLASH_IF_WRITE_ERROR;
      break;
    }

    if (ret_status != FLASH_IF_OK)
    {
      /* Error occurred while writing data in Flash memory */
      break;
    }

    /* Increment FLASH destination address, source address, and decrease remaining length */
    uDest += length;
    uSource += length;
    length = ((uLength - length) > MX25L4006_SECTOR_SIZE) ? MX25L4006_SECTOR_SIZE : uLength - length;
  }
  /* USER CODE BEGIN FLASH_IF_EXT_Write_2 */

  /* USER CODE END FLASH_IF_EXT_Write_2 */
  return ret_status;
}

static FLASH_IF_StatusTypedef FLASH_IF_EXT_Read(void *pDestination, const void *pSource, uint32_t uLength)
{
  FLASH_IF_StatusTypedef ret_status = FLASH_IF_OK;
  /* USER CODE BEGIN FLASH_IF_EXT_Read_1 */

  /* USER CODE END FLASH_IF_EXT_Read_1 */
  if ((pDestination == NULL) || (pSource == NULL))
  {
    return FLASH_IF_PARAM_ERROR;
  }

  if (BSP_FLASH_Read(FLASH_IF_EXT_INSTANCE, (uint8_t *) pDestination, (uint32_t) pSource - FLASH_IF_EXT_FLASH_ADDRESS,
                     uLength) != BSP_ERROR_NONE)
  {
    ret_status = FLASH_IF_READ_ERROR;
  }
  /* USER CODE BEGIN FLASH_IF_EXT_Read_2 */

  /* USER CODE END FLASH_IF_EXT_Read_2 */
  return ret_status;
}

static FLASH_IF_StatusTypedef FLASH_IF_EXT_Erase(void *pStart, uint32_t uLength)
{
  FLASH_IF_StatusTypedef ret_status = FLASH_IF_OK;
  /* USER CODE BEGIN FLASH_IF_EXT_Erase_1 */

  /* USER CODE END FLASH_IF_EXT_Erase_1 */
  uint32_t uStart = (uint32_t)pStart;
  uint32_t index = 0;
  uint32_t sector_start = SECTOR_INDEX(uStart);
  uint32_t number_sectors = SECTOR_INDEX(uStart + uLength - 1U) - sector_start + 1U;

  if (pStart == NULL)
  {
    return FLASH_IF_PARAM_ERROR;
  }

  /* Loop on 4 KBytes block */
  for (index = sector_start ; index < (sector_start + number_sectors); index++)
  {
    if (BSP_FLASH_Erase_Sector(FLASH_IF_EXT_INSTANCE, index * MX25L4006_SECTOR_SIZE) != BSP_ERROR_NONE)
    {
      ret_status = FLASH_IF_ERASE_ERROR;
      break;
    }
  }
  /* USER CODE BEGIN FLASH_IF_EXT_Erase_2 */

  /* USER CODE END FLASH_IF_EXT_Erase_2 */
  return ret_status;
}

static int32_t FLASH_IF_EXT_IsEmpty(void *pStart, uint32_t uLength)
{
  int32_t status = FLASH_IF_MEM_EMPTY;
  /* USER CODE BEGIN FLASH_IF_EXT_IsEmpty_1 */

  /* USER CODE END FLASH_IF_EXT_IsEmpty_1 */
  uint32_t index;
  uint64_t buffer;
  for (index = 0; index < uLength; index += 8)
  {
    if (FLASH_IF_EXT_Read((void *)&buffer, pStart, 8) != FLASH_IF_OK)
    {
      status = FLASH_IF_ERROR;
      break;
    }
    if (buffer != UINT64_MAX)
    {
      status = FLASH_IF_MEM_NOT_EMPTY;
      break;
    }
    pStart = (void *)((uint32_t)pStart + 8U);
  }
  /* USER CODE BEGIN FLASH_IF_EXT_IsEmpty_2 */

  /* USER CODE END FLASH_IF_EXT_IsEmpty_2 */
  return status;
}

/* USER CODE BEGIN PrFD */

/* USER CODE END PrFD */

/* HAL overload functions ---------------------------------------------------------*/
/**
  * @note This function overwrites the __weak one from HAL
  */
void HAL_FLASH_EndOfOperationCallback(uint32_t ReturnValue)
{
  /* USER CODE BEGIN HAL_FLASH_EndOfOperationCallback_1 */

  /* USER CODE END HAL_FLASH_EndOfOperationCallback_1 */
  if (ReturnValue == 0xFFFFFFFFUL)
  {
    /* Call when all requested pages have been erased */
  }
  /* USER CODE BEGIN HAL_FLASH_EndOfOperationCallback_2 */

  /* USER CODE END HAL_FLASH_EndOfOperationCallback_2 */
}

/**
  * @note This function overwrites the __weak one from HAL
  */
void HAL_FLASH_OperationErrorCallback(uint32_t ReturnValue)
{
  /* USER CODE BEGIN HAL_FLASH_OperationErrorCallback_1 */

  /* USER CODE END HAL_FLASH_OperationErrorCallback_1 */
}

/* USER CODE BEGIN Overload_HAL_weaks */

/* USER CODE END Overload_HAL_weaks */
